Autodesk.Navisworks.Api.Plugins.PluginLoadException
The exception that is thrown when a plugin fails to load

Autodesk.Navisworks.Api.Plugins.PluginLoadException.#ctor
Creates a PluginLoadException

Autodesk.Navisworks.Api.Plugins.PluginLoadException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Creates a PluginLoadException

Autodesk.Navisworks.Api.Plugins.PluginLoadException.#ctor(System.String)
Creates a PluginLoadException
message: The error message that explains the reason for the exception.

Autodesk.Navisworks.Api.Plugins.PluginLoadException.#ctor(System.String,System.Exception)
Creates a PluginLoadException
message: The error message that explains the reason for the exception.
innerException: The exception that is the cause of the current exception. If the innerException parameter is not null, the current exception is raised in a catch block that handles the inner exception.